# Умова: Запитай у користувача назву планети, 
# куди він летить, та відстань до неї в кілометрах 
# (число). Потім виведи повідомлення: "Готуємося до 
# польоту на [планета]. Залишилося подолати [відстань] км!" 

# Бонус(додаткове завдання): Спробуй відняти від відстані 
# 100 і вивести: "Ми пролетіли частину шляху! Залишилося: 
# [нова_відстань] км".

planet = input("Введіть назву планети, куди ви летите: ")
distance = int(input("Введіть відстань до планети в кілометрах: "))

print(f"Готуємося до польоту на {planet}. Залишилося подолати {distance} км!")

# Бонус
new_distance = distance - 100
print(f"Ми пролетіли частину шляху! Залишилося: {new_distance} км")